<a href="https://colab.research.google.com/github/Kim-yongbeom/python_DB/blob/main/data04/%ED%83%80%EC%9D%B4%ED%83%80%EB%8B%89.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import pandas as pd
import numpy as np

In [111]:
df = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/titanic.csv')

In [112]:
df

     Survived  Pclass  ... Parents/Children Aboard     Fare
0           0       3  ...                       0   7.2500
1           1       1  ...                       0  71.2833
2           1       3  ...                       0   7.9250
3           1       1  ...                       0  53.1000
4           0       3  ...                       0   8.0500
..        ...     ...  ...                     ...      ...
882         0       2  ...                       0  13.0000
883         1       1  ...                       0  30.0000
884         0       3  ...                       2  23.4500
885         1       1  ...                       0  30.0000
886         0       3  ...                       0   7.7500

[887 rows x 8 columns]

In [113]:
df['Gender'] = df['Sex'].map({'female':1,'male':0}).astype(int)

In [114]:
df['Age'] = df['Age'].astype(int)

In [115]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    int64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
 8   Gender                   887 non-null    int64
dtypes: float64(1), int64(6), object(2)
memory usage: 62.5+ KB

In [116]:
df

     Survived  Pclass  ...     Fare Gender
0           0       3  ...   7.2500      0
1           1       1  ...  71.2833      1
2           1       3  ...   7.9250      1
3           1       1  ...  53.1000      1
4           0       3  ...   8.0500      0
..        ...     ...  ...      ...    ...
882         0       2  ...  13.0000      0
883         1       1  ...  30.0000      1
884         0       3  ...  23.4500      1
885         1       1  ...  30.0000      0
886         0       3  ...   7.7500      0

[887 rows x 9 columns]

In [119]:
df['Age/10'] = df['Age']//10*10

In [120]:
del df['Sex']
del df['Name']
del df['Age']

In [121]:
df['Age/10'] = df['Age/10'].astype(int)

In [122]:
df

     Survived  Pclass  Siblings/Spouses Aboard  ...     Fare  Gender  Age/10
0           0       3                        1  ...   7.2500       0      20
1           1       1                        1  ...  71.2833       1      30
2           1       3                        0  ...   7.9250       1      20
3           1       1                        1  ...  53.1000       1      30
4           0       3                        0  ...   8.0500       0      30
..        ...     ...                      ...  ...      ...     ...     ...
882         0       2                        0  ...  13.0000       0      20
883         1       1                        0  ...  30.0000       1      10
884         0       3                        1  ...  23.4500       1       0
885         1       1                        0  ...  30.0000       0      20
886         0       3                        0  ...   7.7500       0      30

[887 rows x 7 columns]

In [123]:
from sklearn.model_selection import train_test_split

In [224]:
x_data = df.loc[:, 'Pclass':'Age/10'] # 문제데이터
y_data = df.loc[:, 'Survived'] # 정답데이터

In [225]:
x_train, x_test, y_train, y_test = train_test_split(
    x_data, # 문제 데이터
    y_data, # 답 데이터
    test_size =0.2, # 비율
    shuffle = True, # 셔플링 여부
    random_state = 20 # 시드값
)

In [226]:
x_train

     Pclass  Siblings/Spouses Aboard  ...  Gender  Age/10
605       2                        1  ...       1      20
768       2                        0  ...       1      50
29        3                        0  ...       0      20
49        3                        4  ...       0       0
105       3                        0  ...       1      20
..      ...                      ...  ...     ...     ...
218       2                        0  ...       0      30
223       1                        1  ...       0      30
271       1                        0  ...       0      30
474       3                        1  ...       0      20
355       2                        0  ...       1      30

[709 rows x 6 columns]

In [227]:
y_train

605    1
768    0
29     0
49     0
105    1
      ..
218    0
223    1
271    0
474    0
355    0
Name: Survived, Length: 709, dtype: int64

In [228]:
from sklearn.neighbors import KNeighborsClassifier

In [229]:
knn = KNeighborsClassifier(n_neighbors=3)

In [230]:
knn.fit(x_train,y_train)

KNeighborsClassifier(n_neighbors=3)

In [231]:
pred = knn.predict(x_test)
pred

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0,
       0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1,
       1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1,
       1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1,
       0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0,
       0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0,
       0, 0])

In [232]:
from sklearn.metrics import accuracy_score

In [233]:
jumsu = accuracy_score(y_test, pred) # 원래정답, 내가푼답
jumsu # accuracy

0.7528089887640449

In [234]:
from sklearn.svm import SVC

In [251]:
svc = SVC(kernel='linear')

In [252]:
svc.fit(x_train, y_train)

SVC(kernel='linear')

In [253]:
pred2 = svc.predict(x_test)
pred2

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1,
       1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0,
       1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1,
       0, 1])

In [254]:
jumsu2 = accuracy_score(y_test, pred2)
jumsu2

0.7752808988764045